In [1]:
people = {'Firstname':['Sudhumna','Ram','Shyam'],
          'Lastname':['Phuyal','Shrestha','Magar'],
          'Roll no':[1,2,3]
    
}

In [2]:
people

{'Firstname': ['Sudhumna', 'Ram', 'Shyam'],
 'Lastname': ['Phuyal', 'Shrestha', 'Magar'],
 'Roll no': [1, 2, 3]}

In [3]:
people['Firstname']

['Sudhumna', 'Ram', 'Shyam']

In [4]:
people['Firstname'][0]

'Sudhumna'

In [5]:
import pandas as pd

In [21]:
pd.set_option('display.max_columns',20)
pd.set_option('display.max_rows',20)

In [6]:
df = pd.DataFrame(people)

In [7]:
df

  Firstname  Lastname  Roll no
0  Sudhumna    Phuyal        1
1       Ram  Shrestha        2
2     Shyam     Magar        3

In [8]:
 df['Roll no']

0    1
1    2
2    3
Name: Roll no, dtype: int64

In [9]:
df[['Firstname','Lastname']]

  Firstname  Lastname
0  Sudhumna    Phuyal
1       Ram  Shrestha
2     Shyam     Magar

In [10]:
df.columns

Index(['Firstname', 'Lastname', 'Roll no'], dtype='object')

In [11]:
df.iloc[0]

Firstname    Sudhumna
Lastname       Phuyal
Roll no             1
Name: 0, dtype: object

In [19]:
df.iloc[[0,1],[0,1]]

  Firstname  Lastname
0  Sudhumna    Phuyal
1       Ram  Shrestha

In [15]:
df.loc[0]

Firstname    Sudhumna
Lastname       Phuyal
Roll no             1
Name: 0, dtype: object

In [16]:
df.loc[[1,2]]

  Firstname  Lastname  Roll no
1       Ram  Shrestha        2
2     Shyam     Magar        3

In [17]:
df.loc[[1,2],['Firstname','Lastname']]

  Firstname  Lastname
1       Ram  Shrestha
2     Shyam     Magar